In [1]:
s = """
Titanic Machine learning from disaster

Columns     DESCRIPTION:
survival	Survival	            0 = No, 1 = Yes
pclass      Ticket class	        1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex	
Age	        Age in years	
sibsp	    # of siblings / spouses aboard the Titanic	
parch	    # of parents / children aboard the Titanic	
ticket	    Ticket number	
fare	    Passenger fare	
cabin	    Cabin number	
embarked	Port of Embarkation	    C = Cherbourg, Q = Queenstown, S = Southampton

"""
print(s)

Titanic Machine learning from disaster

Columns     DESCRIPTION:
survival	Survival	            0 = No, 1 = Yes
pclass      Ticket class	        1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex
Age	        Age in years
sibsp	    # of siblings / spouses aboard the Titanic
parch	    # of parents / children aboard the Titanic
ticket	    Ticket number
fare	    Passenger fare
cabin	    Cabin number
embarked	Port of Embarkation	    C = Cherbourg, Q = Queenstown, S = Southampton

In [26]:
import os
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import warnings
import seaborn as sns
from sklearn.linear_model import LogisticRegression
from sklearn.linear_model import LinearRegression
from  sklearn.ensemble import RandomForestClassifier
warnings.filterwarnings(action = 'ignore')

In [81]:
PATH = "..\Titanic - Machine learning from disaster\\titanic"
    
FILES = os.listdir(PATH)
s = """
xTrain = pd.read_csv(PATH + "\\" + "imp_train.csv")

xTest = pd.read_csv(PATH + "\\" + "imp_test.csv")

_X = xTrain.drop(columns = 'Survived', inplace = False)
y = xTrain['Survived']

X = pd.concat([_X, xTest], axis = 0)

X.shape
"""
xTrain = pd.read_csv(PATH + "\\" + "imp_train.csv")

xTest = pd.read_csv(PATH + "\\" + "imp_test.csv")

y = pd.read_csv(PATH + "\\" + "train.csv")

#FILES

In [84]:
xTrain.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Type
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Train
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Train
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Train
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Train
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Train

In [74]:
xTest.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Type
0,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Train
1,18,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,Train
2,20,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,Train
3,27,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,Train
4,29,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q,Train

In [7]:
s = """
Useless features:
    1. passengerID  : random numbers
    2. Cabin number : lot's of NaN value
    3. Ticket number
Feature engineering :
    1. Name : extract titles Mr. Mrs. Dr. 
    2. SipSb Parch : family size
Others:
    1. Pclass : categorical
    2. Sex : categorical
    3. Fare : continuous
    4. Embarked : categorical 
    5. Age : continuous
"""

print(s)

Useless features:
    1. passengerID  : random numbers
    2. Cabin number : lot's of NaN value
    3. Ticket number
Feature engineering :
    1. Name : extract titles Mr. Mrs. Dr.
    2. SipSb Parch : family size
Others:
    1. Pclass : categorical
    2. Sex : categorical
    3. Fare : continuous
    4. Embarked : categorical
    5. Age : continuous

In [8]:
useless = ['PassengerId', 'Cabin', 'Ticket']
forFeatEx = ['Name', 'SibSp', 'Parch']
rest = ['Pclass', 'Sex', 'Fare', 'Embarked', 'Age']

In [85]:
# remove useless features
_xTrain = xTrain.drop(columns = useless)
_xTest = xTest.drop(columns = useless)
_xTest.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Type
0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,Q,Train
1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,13.0000,S,Train
2,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,7.2250,C,Train
3,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,7.2250,C,Train
4,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,7.8792,Q,Train

In [10]:
# feature extration with name
def featEx_name(df):
    trainL = []
    for _strain in list(df.Name):
        _s = _strain.split(", ")[1]
        trainL.append(_s.split(" ")[0])
    df['Salutation'] = trainL
    return df
def featEx_familySize(df):
    parch = list(df.Parch)
    sibsb = list(df.SibSp)
    familySize = [parch[i] + sibsb[i] for i in range(len(parch))]
    df['FamSize'] = familySize
    return df

In [86]:
__xTrain = featEx_name(_xTrain)
__xTest = featEx_name(_xTest)
__xTest.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Type,Salutation
0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,Q,Train,Mr.
1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,13.0000,S,Train,Mr.
2,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,7.2250,C,Train,Mrs.
3,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,7.2250,C,Train,Mr.
4,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,7.8792,Q,Train,Miss.

In [87]:
__xTrain = featEx_familySize(__xTrain)
__xTest = featEx_familySize(__xTest)
__xTest.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Type,Salutation,FamSize
0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,Q,Train,Mr.,0
1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,13.0000,S,Train,Mr.,0
2,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,7.2250,C,Train,Mrs.,0
3,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,7.2250,C,Train,Mr.,0
4,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,7.8792,Q,Train,Miss.,0

In [88]:
def createDumm(df, cols):
    for c in cols:
        d = pd.get_dummies(df[c])
        df = pd.concat([df, d], axis = 1)
    return df

categorical = ['Pclass', 'Sex', 'Embarked', 'Salutation']
__xTrain= createDumm(__xTrain, cols = categorical)
__xTest= createDumm(__xTest, cols = categorical)
__xTrain = __xTrain.drop(columns = categorical, inplace = False)
__xTest = __xTest.drop(columns = categorical, inplace = False)

__xTest.head()

,Name,Age,SibSp,Parch,Fare,Type,FamSize,1,2,3,...,male,C,Q,S,Dr.,Master.,Miss.,Mr.,Mrs.,Ms.
0,"Moran, Mr. James",NaN,0,0,8.4583,Train,0,0,0,1,...,1,0,1,0,0,0,0,1,0,0
1,"Williams, Mr. Charles Eugene",NaN,0,0,13.0000,Train,0,0,1,0,...,1,0,0,1,0,0,0,1,0,0
2,"Masselmani, Mrs. Fatima",NaN,0,0,7.2250,Train,0,0,0,1,...,0,1,0,0,0,0,0,0,1,0
3,"Emir, Mr. Farred Chehab",NaN,0,0,7.2250,Train,0,0,0,1,...,1,1,0,0,0,0,0,1,0,0
4,"O'Dwyer, Miss. Ellen ""Nellie""",NaN,0,0,7.8792,Train,0,0,0,1,...,0,0,1,0,0,0,1,0,0,0

In [89]:
__xTrain = __xTrain.drop(columns = ['Name'])
__xTest = __xTest.drop(columns = ['Name'])
__xTest.head()

,Age,SibSp,Parch,Fare,Type,FamSize,1,2,3,female,male,C,Q,S,Dr.,Master.,Miss.,Mr.,Mrs.,Ms.
0,NaN,0,0,8.4583,Train,0,0,0,1,0,1,0,1,0,0,0,0,1,0,0
1,NaN,0,0,13.0000,Train,0,0,1,0,0,1,0,0,1,0,0,0,1,0,0
2,NaN,0,0,7.2250,Train,0,0,0,1,1,0,1,0,0,0,0,0,0,1,0
3,NaN,0,0,7.2250,Train,0,0,0,1,0,1,1,0,0,0,0,0,1,0,0
4,NaN,0,0,7.8792,Train,0,0,0,1,1,0,0,1,0,0,0,1,0,0,0

In [52]:
# lots of NaN values in TRAIN::age, TEST::age, and 1 NaN value in TEST::fare
#__x.fillna(__x.mean(), inplace = True)

#

def imput(X, mode = 'mean'):
    if mode == 'mean':
        _X = X.fillna(X.mean(), inplace = False)
    elif mode == 'reg':
        return 0
    return _X

#__x = imput(__x, mode = 'mean')
__x.isna().sum()

Name           0
Age          263
SibSp          0
Parch          0
Fare           1
FamSize        0
1              0
2              0
3              0
female         0
male           0
C              0
Q              0
S              0
Capt.          0
Col.           0
Don.           0
Dona.          0
Dr.            0
Jonkheer.      0
Lady.          0
Major.         0
Master.        0
Miss.          0
Mlle.          0
Mme.           0
Mr.            0
Mrs.           0
Ms.            0
Rev.           0
Sir.           0
the            0
dtype: int64

In [24]:
#visualizing heat map. 
__x.columns

Index([      'Age',     'SibSp',     'Parch',      'Fare',   'FamSize',
                 1,           2,           3,    'female',      'male',
               'C',         'Q',         'S',     'Capt.',      'Col.',
            'Don.',     'Dona.',       'Dr.', 'Jonkheer.',     'Lady.',
          'Major.',   'Master.',     'Miss.',     'Mlle.',      'Mme.',
             'Mr.',      'Mrs.',       'Ms.',      'Rev.',      'Sir.',
             'the'],
      dtype='object')

In [102]:
def useLR(X, y):
    _lenofy = y.shape[0]
    xtrain = X[0:_lenofy]
    xtest = X[_lenofy:]
    
    lr = LogisticRegression()
    
    lr.fit(xtrain, y)
    
    return lr.predict(xtest)
def Linreg ( trainx, trainy, testx):
    
    print(trainx.isna().any())
    print(testx.isna().any())
    linr = LinearRegression()
    
    linr.fit(trainx, trainy)
    
    return linr.predict(testx)

In [27]:
res = useLR(__x, y)
res
data = {'PassengerId' : list(range(892, 1310)), 'Survived' : res }

df = pd.DataFrame(data)
df.to_csv("result.csv")
#_train[0:10]
#train.head

In [104]:
y = __xTrain['Age']
x = __xTrain.drop(inplace = False, columns = ['Age', 'Type','Fare'])
testx = __xTest.drop(inplace = False, columns = ['Age', 'Type', 'Fare'])
#Linreg(trainx = x, trainy = y, testx = testx)

#x.head()

SibSp        False
Parch        False
FamSize      False
1            False
2            False
3            False
female       False
male         False
C            False
Q            False
S            False
Capt.        False
Col.         False
Don.         False
Dona.        False
Dr.          False
Jonkheer.    False
Lady.        False
Major.       False
Master.      False
Miss.        False
Mlle.        False
Mme.         False
Mr.          False
Mrs.         False
Ms.          False
Rev.         False
Sir.         False
the          False
dtype: bool
SibSp      False
Parch      False
FamSize    False
1          False
2          False
3          False
female     False
male       False
C          False
Q          False
S          False
Dr.        False
Master.    False
Miss.      False
Mr.        False
Mrs.       False
Ms.        False
dtype: bool

ValueError: matmul: Input operand 1 has a mismatch in its core dimension 0, with gufunc signature (n?,k),(k,m?)->(n?,m?) (size 29 is different from 17)